16C-programs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-26 Sun 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HP-16C programs</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">HP-16C programs</h1>
<p>
press <code>g P/R</code> to toggle programming mode, <code>GTO . &lt;nnn&gt;</code> to jump to a
line, <code>BSP</code> to delete a line, and <code>g RTN</code> to end a program.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. exponent function</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> exponent function</h2>
<div class="outline-text-2" id="text-1">
<p>
(for positive integers only)
</p>

<p>
borrowed from <a href="https://imapenguin.com/simple-exponents-on-an-hp-16c/">this blog</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">num</th>
<th scope="col" class="org-left">keys</th>
<th scope="col" class="org-left">display</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">001</td>
<td class="org-left">LBL E</td>
<td class="org-left">43,22, E</td>
<td class="org-left">convenient entry point</td>
</tr>

<tr>
<td class="org-right">002</td>
<td class="org-left">ENTER</td>
<td class="org-left">36</td>
<td class="org-left">push stack</td>
</tr>

<tr>
<td class="org-right">003</td>
<td class="org-left">1</td>
<td class="org-left">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">004</td>
<td class="org-left">-</td>
<td class="org-left">30</td>
<td class="org-left">subtract one, count starts at 0</td>
</tr>

<tr>
<td class="org-right">005</td>
<td class="org-left">X&lt;-&gt;I</td>
<td class="org-left">42 22</td>
<td class="org-left">push to "increment/decrement" counter</td>
</tr>

<tr>
<td class="org-right">006</td>
<td class="org-left">X&lt;-&gt;Y</td>
<td class="org-left">34</td>
<td class="org-left">swap</td>
</tr>

<tr>
<td class="org-right">007</td>
<td class="org-left">STO A</td>
<td class="org-left">44 A</td>
<td class="org-left">store</td>
</tr>

<tr>
<td class="org-right">008</td>
<td class="org-left">ENTER</td>
<td class="org-left">36</td>
<td class="org-left">push stack</td>
</tr>

<tr>
<td class="org-right">009</td>
<td class="org-left">LBL 0</td>
<td class="org-left">43,22, 0</td>
<td class="org-left">label for loop target</td>
</tr>

<tr>
<td class="org-right">010</td>
<td class="org-left">X&lt;-&gt;Y</td>
<td class="org-left">34</td>
<td class="org-left">swap</td>
</tr>

<tr>
<td class="org-right">011</td>
<td class="org-left">RCL A</td>
<td class="org-left">45 A</td>
<td class="org-left">push A to stack</td>
</tr>

<tr>
<td class="org-right">012</td>
<td class="org-left">*</td>
<td class="org-left">20</td>
<td class="org-left">multiply it</td>
</tr>

<tr>
<td class="org-right">013</td>
<td class="org-left">ENTER</td>
<td class="org-left">36</td>
<td class="org-left">push stack up 1</td>
</tr>

<tr>
<td class="org-right">014</td>
<td class="org-left">DSZ</td>
<td class="org-left">43 23</td>
<td class="org-left">decrement and branch to LBL 0 unless 0</td>
</tr>

<tr>
<td class="org-right">015</td>
<td class="org-left">GTO 0</td>
<td class="org-left">22 0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">016</td>
<td class="org-left">RTN</td>
<td class="org-left">43 21</td>
<td class="org-left">return</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>